-- phpMyAdmin SQL Dump
-- version 4.0.4.1
-- http://www.phpmyadmin.net
--
-- Host: 127.0.0.1
-- Generation Time: Sep 16, 2016 at 12:23 PM
-- Server version: 5.6.11
-- PHP Version: 5.5.1

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- Database: `android_app_ecfun`
--
CREATE DATABASE IF NOT EXISTS `android_app_ecfun` DEFAULT CHARACTER SET latin1 COLLATE latin1_swedish_ci;
USE `android_app_ecfun`;

-- --------------------------------------------------------

--
-- Table structure for table `pl_information`
--

CREATE TABLE IF NOT EXISTS `pl_information` (
  `pl_id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `user_phone` varchar(20) CHARACTER SET gbk NOT NULL,
  `pl_content` varchar(512) CHARACTER SET gbk NOT NULL,
  `pl_time` varchar(256) CHARACTER SET gbk NOT NULL,
  `pl_num` int(10) NOT NULL,
  `pl_zan` int(10) NOT NULL,
  PRIMARY KEY (`pl_id`)
) ENGINE=InnoDB  DEFAULT CHARSET=latin1 AUTO_INCREMENT=40 ;

--
-- Dumping data for table `pl_information`
--

INSERT INTO `pl_information` (`pl_id`, `user_phone`, `pl_content`, `pl_time`, `pl_num`, `pl_zan`) VALUES
(1, '17863963884', '哎呦不错哦', '2016-05-17 12:51:25', 55, 0),
(2, '17863963884', '超级论 超级长评论 超级长评论测试 超级长评论测试 超级长评论测试 超级长评论测试 长评论测试 长评论测试 长评论测试 长评论测试 超级长 超级长评论 超级长评论测试 超级长评论测试 超级长评论测试 超级长评论测试 长评论测 测试 试 长评论测试 超级长评论测试', '2016-05-17 13:10:04', 55, 0),
(3, '17863963884', '评论测试', '2016-05-17 13:25:59', 54, 0),
(4, '17863963884', '好开心，又吃成长快乐了', '2016-05-17 16:12:31', 56, 0),
(5, '17863963884', '哎呦喂不错哦', '2016-05-17 20:32:25', 58, 0),
(6, '17863963884', '中毒太深', '2016-05-17 23:08:51', 59, 0),
(7, '17863963884', '输入你的评论', '2016-06-23 23:51:28', 58, 0),
(8, '17863963884', '无聊', '2016-06-27 12:07:05', 62, 0),
(9, '17863963884', '哎呦不错哦', '2016-06-28 23:10:19', 73, 0),
(10, '17863963884', '不错', '2016-06-28 23:10:34', 73, 0),
(11, '17863963884', '九宫格比较漂亮', '2016-06-28 23:10:50', 73, 0),
(12, '17863963884', '为什么评论只显示两条', '2016-06-28 23:11:35', 73, 0),
(13, '17863963884', '输入你的评论', '2016-06-28 23:20:59', 73, 1),
(14, '17863963884', '输入你的评论', '2016-06-28 23:21:05', 73, 0),
(15, '17863963884', '8', '2016-06-28 23:21:40', 73, 0),
(16, '17863963884', '9', '2016-06-28 23:21:47', 73, 0),
(17, '17863963884', '7', '2016-06-28 23:21:55', 73, 1),
(18, '17863963884', '6', '2016-06-28 23:22:02', 73, 0),
(19, '17863963884', '5', '2016-06-28 23:22:11', 73, 0),
(20, '17863963884', 'mlt', '2016-06-28 23:41:41', 75, 0),
(21, '17863963884', '陈奕迅1882', '2016-06-28 23:41:58', 75, 0),
(22, '17863963884', '芙蓉街', '2016-06-28 23:42:15', 75, 0),
(23, '17863963884', '评论一下不会怀孕，我就是要评论好多字，好多字，，，，，，，，，，，，，，，，，，，，好多字，，，，，，，，，，，，，，，，，，，，，，，', '2016-06-29 19:56:32', 73, 5),
(24, '17863963884', '评论一下不会怀孕', '2016-06-30 01:15:40', 80, 0),
(25, '17863963884', '评论一下不会怀孕', '2016-06-30 01:15:43', 80, 0),
(26, '17863963884', '评论一下不会怀孕', '2016-06-30 01:15:46', 80, 1),
(27, '17863963884', '评论一下不会怀孕', '2016-06-30 10:43:39', 73, 0),
(28, '17863963884', '评论一下不会怀孕', '2016-06-30 18:30:55', 90, 6),
(29, '17863963884', '评论一下不会怀孕', '2016-06-30 18:31:38', 90, 0),
(30, '17863963884', '评论一下不会怀孕', '2016-06-30 18:31:40', 90, 0),
(31, '17863963884', '评论一下不会怀孕', '2016-06-30 18:31:42', 90, 0),
(32, '17863963884', '评论一下不会怀孕', '2016-06-30 18:31:44', 90, 10),
(33, '17854259542', '评论一下不会怀孕', '2016-07-01 22:07:48', 91, 0),
(34, '17854259542', '推送测试', '2016-07-01 22:39:15', 90, 0),
(35, '17854259542', '评论一下不会怀孕', '2016-07-01 22:41:33', 91, 0),
(36, '17854259542', '评论一下不会怀孕', '2016-07-01 22:42:04', 91, 0),
(37, '17854259542', '评论一下不会怀孕', '2016-07-01 22:56:22', 91, 0),
(38, '17863963884', '评论一下不会怀孕', '2016-07-04 01:24:14', 96, 1),
(39, '17854259542', '评论一下不会怀孕', '2016-09-16 14:17:07', 96, 0);

-- --------------------------------------------------------

--
-- Table structure for table `qr_information`
--

CREATE TABLE IF NOT EXISTS `qr_information` (
  `qr_id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `user_phone` varchar(20) CHARACTER SET gbk NOT NULL,
  `qr_url` varchar(512) CHARACTER SET gbk NOT NULL DEFAULT 'http://139.129.40.202/ecfun/qr/404.php',
  `qr_content` varchar(512) CHARACTER SET gbk NOT NULL DEFAULT '开始我的悄悄话',
  `is_finish` varchar(256) CHARACTER SET greek NOT NULL DEFAULT 'Y',
  PRIMARY KEY (`qr_id`)
) ENGINE=InnoDB  DEFAULT CHARSET=latin1 AUTO_INCREMENT=34 ;

--
-- Dumping data for table `qr_information`
--

INSERT INTO `qr_information` (`qr_id`, `user_phone`, `qr_url`, `qr_content`, `is_finish`) VALUES
(1, '17854259555', 'http://115.159.26.120/ecfun/qr/404.php', '开始我的悄悄话', 'Y'),
(2, '17854259555', 'http://115.159.26.120/ecfun/qr/404.php', '开始我的悄悄话', 'Y'),
(3, '17854259555', 'http://115.159.26.120/ecfun/qr/404.php', '开始我的悄悄话', 'Y'),
(4, '17854259542', 'http://115.159.26.120/ecfun/qr/404.php', '开始我的悄悄话', 'Y'),
(5, '17854259542', 'http://115.159.26.120/ecfun/qr/404.php', '开始我的悄悄话', 'Y'),
(6, '17854259542', 'http://115.159.26.120/ecfun/qr/404.php', '开始我的悄悄话', 'Y'),
(7, '17805428721', 'http://115.159.26.120/ecfun/qr/finish.php?user_phone=17805428721&qr_id=7', '哎', 'N'),
(8, '17805428721', 'http://115.159.26.120/ecfun/qr/404.php', '开始我的悄悄话', 'Y'),
(9, '17805428721', 'http://115.159.26.120/ecfun/qr/404.php', '开始我的悄悄话', 'Y'),
(10, '17854253157', 'http://115.159.26.120/ecfun/qr/404.php', '开始我的悄悄话', 'Y'),
(11, '17854253157', 'http://115.159.26.120/ecfun/qr/404.php', '开始我的悄悄话', 'Y'),
(12, '17854253157', 'http://115.159.26.120/ecfun/qr/404.php', '开始我的悄悄话', 'Y'),
(13, '17854251361', 'http://115.159.26.120/ecfun/qr/404.php', '开始我的悄悄话', 'Y'),
(14, '17854251361', 'http://115.159.26.120/ecfun/qr/404.php', '开始我的悄悄话', 'Y'),
(15, '17854251361', 'http://115.159.26.120/ecfun/qr/404.php', '开始我的悄悄话', 'Y'),
(16, '17863963884', 'http://115.159.26.120/ecfun/qr/finish.php?user_phone=17863963884&qr_id=16', '520520520520', 'N'),
(17, '17863963884', 'http://115.159.26.120/ecfun/qr/404.php', '开始我的悄悄话', 'Y'),
(18, '17863963884', 'http://115.159.26.120/ecfun/qr/404.php', '开始我的悄悄话', 'Y'),
(19, '17854258669', 'http://115.159.26.120/ecfun/qr/404.php', '开始我的悄悄话', 'Y'),
(20, '17854258669', 'http://115.159.26.120/ecfun/qr/404.php', '开始我的悄悄话', 'Y'),
(21, '17854258669', 'http://115.159.26.120/ecfun/qr/404.php', '开始我的悄悄话', 'Y'),
(22, '17854288307', 'http://115.159.26.120/ecfun/qr/finish.php?user_phone=17854288307&qr_id=22', '咔咔咔咔咔 啦啦啦啦啦', 'N'),
(23, '17854288307', 'http://115.159.26.120/ecfun/qr/404.php', '开始我的悄悄话', 'Y'),
(24, '17854288307', 'http://115.159.26.120/ecfun/qr/404.php', '开始我的悄悄话', 'Y'),
(25, '17853470912', 'http://115.159.26.120/ecfun/qr/404.php', '开始我的悄悄话', 'Y'),
(26, '17853470912', 'http://115.159.26.120/ecfun/qr/404.php', '开始我的悄悄话', 'Y'),
(27, '17853470912', 'http://115.159.26.120/ecfun/qr/404.php', '开始我的悄悄话', 'Y'),
(28, '13658667478', 'http://115.159.26.120/ecfun/qr/finish.php?user_phone=13658667478&qr_id=28', '开始我的悄悄话', 'N'),
(29, '13658667478', 'http://139.129.40.202/ecfun/qr/404.php', '开始我的悄悄话', 'Y'),
(30, '13658667478', 'http://139.129.40.202/ecfun/qr/404.php', '开始我的悄悄话', 'Y'),
(31, '18766260763', 'http://139.129.40.202/ecfun/qr/404.php', '开始我的悄悄话', 'Y'),
(32, '18766260763', 'http://139.129.40.202/ecfun/qr/404.php', '开始我的悄悄话', 'Y'),
(33, '18766260763', 'http://139.129.40.202/ecfun/qr/404.php', '开始我的悄悄话', 'Y');

-- --------------------------------------------------------

--
-- Table structure for table `talk_information`
--

CREATE TABLE IF NOT EXISTS `talk_information` (
  `talk_id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `talk_content` varchar(20480) CHARACTER SET gbk NOT NULL,
  `talk_time` varchar(256) CHARACTER SET gbk NOT NULL,
  `talk_url` varchar(4096) CHARACTER SET gbk NOT NULL,
  `user_phone` varchar(20) CHARACTER SET gbk NOT NULL,
  `talk_zan` int(10) NOT NULL,
  `phonety` varchar(50) CHARACTER SET gbk NOT NULL DEFAULT '安卓客户端',
  PRIMARY KEY (`talk_id`)
) ENGINE=InnoDB  DEFAULT CHARSET=latin1 AUTO_INCREMENT=98 ;

--
-- Dumping data for table `talk_information`
--

INSERT INTO `talk_information` (`talk_id`, `talk_content`, `talk_time`, `talk_url`, `user_phone`, `talk_zan`, `phonety`) VALUES
(1, '我叫ecfun，叫我ecfun', '2016-05-08 13:04:45', 'http://139.129.40.202/ecfun/image_bg_upload/upload/404.jpg', '17863963884', 5, '安卓客户端'),
(2, 'WELCOME TO ECFUN', '2016-05-08 14:07:45', 'http://139.129.40.202/ecfun/image_bg_upload/upload/404.jpg', '17863963884', 0, '安卓客户端'),
(5, '图片测试2', '2016-05-08 17:22:21', 'http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160508172214_.jpg', '17863963884', 0, '安卓客户端'),
(7, '图片测试', '2016-05-08 19:56:49', 'http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160508195641_.jpg', '17863963884', 5, '安卓客户端'),
(8, '刷新测试', '2016-05-08 21:17:01', 'http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160508211658_.jpg', '17863963884', 0, '安卓客户端'),
(9, '图片头像测试', '2016-05-08 22:42:52', 'http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160508224249_.jpg', '17863963884', 0, '安卓客户端'),
(10, '最长测试最长测试 最长测试最长测试 最长测试最长测试 最长测试最长测试 最长测试 最长测试最长测试 最长测试最长测试 最长 最长测试最长测试 最长测试最长测试 最长测试最长测试 最长测试最长测试 最长测试最长测试 测试最长测试 最长测试最长测试 最长测试最长测试 长测试啊啊啊啊？', '2016-05-08 23:25:55', 'http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160508232550_.jpg', '17863963884', 0, '安卓客户端'),
(11, '', '2016-05-09 18:16:32', 'http://139.129.40.202/ecfun/image_bg_upload/upload/404.jpg', '17863963884', 0, '安卓客户端'),
(12, '下拉刷新测试', '2016-05-09 21:44:11', 'http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160509214409_.jpg', '17863963884', 0, '安卓客户端'),
(13, '下拉刷新测试', '2016-05-10 11:17:02', 'http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160509214409_.jpg', '17863963884', 0, '安卓客户端'),
(14, '最长测试最长测试 最长测试最长测试 最长测试最长测试 最长测试最长测试 最长测试 最长测试最长测试 最长测试最长测试 最长 最长测试最长测试 最长测试最长测试 最长测试最长测试 最长测试最长测试 最长测试最长测试 测试最长测试 最长测试最长测试 最长测试最长测试 长测试啊啊啊啊？', '2016-05-10 11:17:40', 'http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160508232550_.jpg', '17863963884', 0, '安卓客户端'),
(15, '@蜡笔小新没有心 \r\n最长测试最长测试 最长测试最长测试 最长测试最长测试 最长测试最长测试 最长测试 最长测试最长测试 最长测试最长测试 最长 最长测试最长测试 最长测试最长测试 最长测试最长测试 最长测试最长测试 最长测试最长测试 测试最长测试 最长测试最长测试 最长测试最长测试 长测试啊啊啊啊？\r\n-----转发', '2016-05-10 11:20:24', 'http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160508232550_.jpg', '17863963884', 0, '安卓客户端'),
(16, '@蜡笔小新没有心 \r\n下拉刷新测试\r\n-----转发', '2016-05-10 11:20:55', 'http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160509214409_.jpg', '17863963884', 0, '安卓客户端'),
(17, '@蜡笔小新没有心 \r\n@蜡笔小新没有心 \r\n下拉刷新测试\r\n-----转发\r\n-----转发', '2016-05-10 11:27:13', 'http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160509214409_.jpg', '17863963884', 0, '安卓客户端'),
(18, '@蜡笔小新没有心 \r\n@蜡笔小新没有心 \r\n最长测试最长测试 最长测试最长测试 最长测试最长测试 最长测试最长测试 最长测试 最长测试最长测试 最长测试最长测试 最长 最长测试最长测试 最长测试最长测试 最长测试最长测试 最长测试最长测试 最长测试最长测试 测试最长测试 最长测试最长测试 最长测试最长测试 长测试啊啊啊啊？\r\n-----转发\r\n-----转发', '2016-05-10 11:27:32', 'http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160508232550_.jpg', '17863963884', 0, '安卓客户端'),
(19, '@蜡笔小新没有心 \r\n@蜡笔小新没有心 \r\n@蜡笔小新没有心 \r\n最长测试最长测试 最长测试最长测试 最长测试最长测试 最长测试最长测试 最长测试 最长测试最长测试 最长测试最长测试 最长 最长测试最长测试 最长测试最长测试 最长测试最长测试 最长测试最长测试 最长测试最长测试 测试最长测试 最长测试最长测试 最长测试最长测试 长测试啊啊啊啊？\r\n-----转发\r\n-----转发', '2016-05-10 11:47:31', 'http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160508232550_.jpg', '17863963884', 0, '安卓客户端'),
(20, '@蜡笔小新没有心 \r\n下拉刷新测试\r\n------------------转发', '2016-05-10 11:56:23', 'http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160509214409_.jpg', '17863963884', 0, '安卓客户端'),
(21, '@蜡笔小新没有心 \r\n@蜡笔小新没有心 \r\n下拉刷新测试\r\n------------------转发', '2016-05-10 11:56:28', 'http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160509214409_.jpg', '17863963884', 0, '安卓客户端'),
(23, '@蜡笔小新没有心 \r\n@蜡笔小新没有心 \r\n@蜡笔小新没有心 \r\n下拉刷新测试\r\n------------------转发', '2016-05-10 15:00:58', 'http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160509214409_.jpg', '17863963884', 0, '安卓客户端'),
(25, '@蜡笔小新没有心 \r\n@蜡笔小新没有心 \r\n@蜡笔小新没有心 \r\n下拉刷新测试\r\n------------------转发', '2016-05-10 22:16:23', 'http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160509214409_.jpg', '17863963884', 3, '安卓客户端'),
(27, '@蜡笔小新没有心 \r\n下拉刷新测试\r\n----------------------------------转发', '2016-05-10 22:19:12', 'http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160509214409_.jpg', '17863963884', 0, '安卓客户端'),
(29, '飞机加油(? ??_??)?', '2016-05-10 22:39:22', 'http://139.129.40.202/ecfun/image_bg_upload/upload/404.jpg', '17854253157', 0, '安卓客户端'),
(32, '在这在这', '2016-05-10 23:09:48', 'http://139.129.40.202/ecfun/image_bg_upload/upload/404.jpg', '17805428721', 0, '安卓客户端'),
(33, '@小慧慧 \r\n在这在这\r\n----------------------------------转发', '2016-05-10 23:10:01', 'http://139.129.40.202/ecfun/image_bg_upload/upload/404.jpg', '17863963884', 0, '安卓客户端'),
(34, '头像有问题，稍等', '2016-05-10 23:10:44', 'http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160510231042_.jpg', '17863963884', 0, '安卓客户端'),
(35, '@蜡笔小新没有心 \r\n@小慧慧 \r\n在这在这\r\n----------------------------------转发', '2016-05-10 23:10:53', 'http://139.129.40.202/ecfun/image_bg_upload/upload/404.jpg', '17805428721', 0, '安卓客户端'),
(37, '头像测试', '2016-05-10 23:23:34', 'http://139.129.40.202/ecfun/image_bg_upload/upload/_1785425954220160510232332_.jpg', '17854259542', 0, '安卓客户端'),
(41, '图片测试', '2016-05-10 23:45:40', 'http://139.129.40.202/ecfun/image_bg_upload/upload/_1785425315720160510234537_.jpg', '17854253157', 0, '安卓客户端'),
(42, '找了一大圈发现有可能是手机问题，', '2016-05-10 23:59:51', 'http://139.129.40.202/ecfun/image_bg_upload/upload/404.jpg', '17863963884', 0, '安卓客户端'),
(44, 'woc？！这么6～', '2016-05-11 07:00:27', 'http://139.129.40.202/ecfun/image_bg_upload/upload/404.jpg', '17854251361', 0, '安卓客户端'),
(45, '@蜡笔小新没有心 \r\nwoc？！这么6～\r\n----------------------------------转发', '2016-05-11 13:25:49', 'http://139.129.40.202/ecfun/image_bg_upload/upload/404.jpg', '17863963884', 0, '安卓客户端'),
(46, '没人玩了，来个推送', '2016-05-11 22:09:34', 'http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160511220932_.jpg', '17863963884', 1, '安卓客户端'),
(47, '@昵称修改GG \r\n@蜡笔小新没有心 \r\n最长测试最长测试 最长测试最长测试 最长测试最长测试 最长测试最长测试 最长测试 最长测试最长测试 最长测试最长测试 最长 最长测试最长测试 最长测试最长测试 最长测试最长测试 最长测试最长测试 最长测试最长测试 测试最长测试 最长测试最长测试 最长测试最长测试 长测试啊啊啊啊？\r\n-----转发', '2016-05-12 11:23:53', 'http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160508232550_.jpg', '17863963884', 0, '安卓客户端'),
(48, '好了没有', '2016-05-13 20:04:34', 'http://139.129.40.202/ecfun/image_bg_upload/upload/_1785425315720160510234537_.jpg', '17854253157', 0, '安卓客户端'),
(49, '呃呃，你收到更新提示了吗', '2016-05-13 20:05:58', 'http://139.129.40.202/ecfun/image_bg_upload/upload/404.jpg', '17863963884', 0, '安卓客户端'),
(50, '突然来的灵感，二维码悄悄话，，，，，', '2016-05-15 13:41:15', 'http://139.129.40.202/ecfun/image_bg_upload/upload/404.jpg', '17863963884', 0, '安卓客户端'),
(51, '@昵称修改GG \r\n突然来的灵感，二维码悄悄话，，，，，\r\n----------------------------------转发', '2016-05-16 00:38:22', 'http://139.129.40.202/ecfun/image_bg_upload/upload/404.jpg', '17863963884', 0, '安卓客户端'),
(52, '@昵称修改GG \r\n突然来的灵感，二维码悄悄话，，，，，\r\n----------------------------------转发', '2016-05-16 00:38:36', 'http://139.129.40.202/ecfun/image_bg_upload/upload/404.jpg', '17863963884', 0, '安卓客户端'),
(53, '@昵称修改GG \r\n@昵称修改GG \r\n突然来的灵感，二维码悄悄话，，，，，\r\n----------------------------------转发', '2016-05-16 00:39:00', 'http://139.129.40.202/ecfun/image_bg_upload/upload/404.jpg', '17863963884', 0, '安卓客户端'),
(54, '下拉刷新有病了？', '2016-05-16 00:40:17', 'http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160516004016_.jpg', '17863963884', 0, '安卓客户端'),
(55, '测试下拉刷新', '2016-05-16 09:30:44', 'http://139.129.40.202/ecfun/image_bg_upload/upload/404.jpg', '17863963884', 1, '安卓客户端'),
(56, '@陈没有赫 \r\n测试下拉刷新\r\n----------------------------------转发', '2016-05-17 13:26:22', 'http://139.129.40.202/ecfun/image_bg_upload/upload/404.jpg', '17863963884', 2, '安卓客户端'),
(57, '我个人很懒,一个字都不发', '2016-05-17 19:40:18', 'http://139.129.40.202/ecfun/image_bg_upload/upload/404.jpg', '17863963884', 1, '安卓客户端'),
(58, '我个人很懒,一个字都不发', '2016-05-17 19:47:43', 'http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160517194742_.jpg', '17863963884', 7, '安卓客户端'),
(59, '哎呦', '2016-05-17 23:02:51', 'http://139.129.40.202/ecfun/image_bg_upload/upload/404.jpg', '17805428721', 14, '安卓客户端'),
(60, '先复习', '2016-05-25 11:36:38', 'http://139.129.40.202/ecfun/image_bg_upload/upload/404.jpg', '17863963884', 2, '安卓客户端'),
(61, '好无聊', '2016-06-19 22:08:22', 'http://139.129.40.202/ecfun/image_bg_upload/upload/404.jpg', '17863963884', 0, '安卓客户端'),
(62, '我个人很懒,一个字都不发', '2016-06-23 21:55:09', 'http://139.129.40.202/ecfun/image_bg_upload/upload/404.jpg', '17863963884', 7, '安卓客户端'),
(63, 'haha', '2016-06-28 21:04:00', 'http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160628210400_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160628210400_.jpg#', '17863963884', 0, '安卓客户端'),
(64, 'yyy', '2016-06-28 21:08:44', 'http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160628210844_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160628210844_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160628210844_.jpg#', '17863963884', 0, '安卓客户端'),
(65, '多图测试', '2016-06-28 21:21:48', 'http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160628212148-0_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160628212148-1_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160628212148-2_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160628212148-3_.jpg#', '17863963884', 0, '安卓客户端'),
(66, '多图测试2', '2016-06-28 21:41:07', 'http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160628214107-0_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160628214107-1_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160628214107-2_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160628214107-3_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160628214107-4_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160628214107-5_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160628214107-6_.jpg#', '17863963884', 0, '安卓客户端'),
(67, '我这个人很懒,一个字都不发', '2016-06-28 21:59:45', 'http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160628215945-0_.jpg#', '17863963884', 0, '安卓客户端'),
(68, '三星多图测试', '2016-06-28 22:18:29', 'http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160628221828-0_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160628221828-1_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160628221829-2_.jpg#', '17863963884', 0, '安卓客户端'),
(69, '大图测试', '2016-06-28 22:23:39', 'http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160628222339-0_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160628222339-1_.jpg#', '17863963884', 0, '安卓客户端'),
(70, '我这个人很懒,一个字都不发', '2016-06-28 22:26:03', 'http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160628222603-0_.jpg#', '17863963884', 0, '安卓客户端'),
(71, 'ceshi', '2016-06-28 22:27:15', 'http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160628222715-0_.jpg#', '17863963884', 1, '安卓客户端'),
(72, '好眼力', '2016-06-28 22:34:09', 'http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160628223408-0_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160628223408-1_.jpg#', '17863963884', 0, '安卓客户端'),
(73, '我这个人很懒,一个字都不发', '2016-06-28 22:39:07', 'http://139.129.40.202/ecfun/image_bg_upload/upload/_1780542872120160628223906-0_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1780542872120160628223906-1_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1780542872120160628223906-2_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1780542872120160628223907-3_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1780542872120160628223907-4_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1780542872120160628223907-5_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1780542872120160628223907-6_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1780542872120160628223907-7_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1780542872120160628223907-8_.jpg#', '17805428721', 3, '安卓客户端'),
(74, '@小慧慧 \r\n我这个人很懒,一个字都不发\r\n----------------------------------转发', '2016-06-28 22:45:50', 'http://139.129.40.202/ecfun/image_bg_upload/upload/_1780542872120160628223906-0_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1780542872120160628223906-1_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1780542872120160628223906-2_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1780542872120160628223907-3_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1780542872120160628223907-4_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1780542872120160628223907-5_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1780542872120160628223907-6_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1780542872120160628223907-7_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1780542872120160628223907-8_.jpg#', '17863963884', 0, '安卓客户端'),
(75, '????????????????', '2016-06-28 22:47:51', 'http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160628224750-0_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160628224750-1_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160628224750-2_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160628224750-3_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160628224750-4_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160628224751-5_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160628224751-6_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160628224751-7_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160628224751-8_.jpg#', '17863963884', 0, '安卓客户端'),
(76, '哇哦', '2016-06-28 22:52:29', 'http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160628225228-0_.jpg#', '17863963884', 0, '安卓客户端'),
(77, '文/树獭先生\n\n图/来源于网络\n\n?学习的本意是让我们摆脱目前的困境，往更好的方向发展。但是由于缺乏适合自己的学习方法，往往很难突破现状，甚至陷入到另外一个僵局里面。很多时候，不是做不好，也不是没有某一方面的天赋，也许真的只是学习“方法”不对。\n\n我们使用的方法是否适合自己的性格，是在学习过程中最容易被我们忽视的问题。学习要强调一个自主性，越是强迫自己学习，就越容易心生厌恶，与其这样，还不如找一个不怎么排斥的学习方法，消除厌恶与抵触的情绪。\n\n掌握最适合的学习方法需要注意以下三点：\n\n1.拥有一技之长而且要求自己精益求精\n\n2你在什么地方注意力最容易集中\n\n3你在什么时候最有干劲\n\n最近在看斋藤孝的《学会学习-从认知自我到高效学习》，该书主要介绍了斋藤孝先生自己突破学习的方法以及对16位伟人的介绍，以及他们的学习方法。每一个人都有自己独特的性格以及适应的环境，所以适应他们的学习方法也是不相同的。\n\n通过这些人的经历和性格，可以帮助我们找到适合自己的学习方法。下面，我跟大家分享一下几个比较典型的学习方法吧。\n\n1.不请自来学习法——献给想要摆脱学历自卑的你\n\n不喜欢阅读但是擅长倾听的人，可以尝试这种方法。具体做法就是：向懂相关专业知识的人请教，不断丰富自己的知识，并且用于生意当中。\n\n本田宗一郎将他的学习目标定位：只学习对工作有用的知识。所以，为了高效率地提升工作质量，他才能毫不动摇、不浪费时间地追求自己的目标。\n\n不是为了掌握新知识而学习，而是先决定好要学什么，再开始行动。本田一郎一直认为：人类需要困境，只有被逼上绝境才会释放出真正的力量，只要用心没有什么做不到。\n\n本田一郎随时保持着清醒，时刻准备就绪的状态。他相信：时刻准备就绪的状态能让人意识清醒，反应速度加快，变得干劲十足。\n\n难以点燃热情、做事被动的人应尝试着多向他人请教，这样有助于提高自身的学习动力。\n\n2.外界屏蔽法——献给爱找借口的你\n\n有的人学习效果不好，并不是学习方法不对，而是从开始学习到完全投入到学习状态花了太久的时间。\n\n比如在图书馆上自习，一边看书，一边玩手机，你根本没有办法将全部精力投入到学习当中去，自然也无法获得更好的学习效果。\n\n如果能迅速集中注意力，就可以在短时间内完成高密度的学习。而想要瞬间引发能量，做到彻底投入，心无旁骛，首先要做的就是调整好自己的心态。明确地告诉自己：我一定要在几点之前完成这些内容。不完成目标决不罢休。\n\n不开', '2016-06-28 23:46:27', 'http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160628234627-0_.jpg#', '17863963884', 3, '安卓客户端'),
(78, 'back测试', '2016-06-29 20:21:02', 'http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160629202102-0_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160629202102-1_.jpg#', '17863963884', 7, '安卓客户端'),
(79, '@小慧慧 \r\n我这个人很懒,一个字都不发\r\n----------------------------------转发', '2016-06-29 21:23:06', 'http://139.129.40.202/ecfun/image_bg_upload/upload/_1780542872120160628223906-0_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1780542872120160628223906-1_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1780542872120160628223906-2_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1780542872120160628223907-3_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1780542872120160628223907-4_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1780542872120160628223907-5_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1780542872120160628223907-6_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1780542872120160628223907-7_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1780542872120160628223907-8_.jpg#', '17863963884', 0, '安卓客户端'),
(80, '@小慧慧 \r\n我这个人很懒,一个字都不发\r\n----------------------------------转发', '2016-06-29 21:41:29', 'http://139.129.40.202/ecfun/image_bg_upload/upload/_1780542872120160628223906-0_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1780542872120160628223906-1_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1780542872120160628223906-2_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1780542872120160628223907-3_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1780542872120160628223907-4_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1780542872120160628223907-5_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1780542872120160628223907-6_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1780542872120160628223907-7_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1780542872120160628223907-8_.jpg#', '17863963884', 6, '安卓客户端'),
(81, '9图卡顿严重', '2016-06-30 01:24:52', 'http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160630012452-0_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160630012452-1_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160630012452-2_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160630012452-3_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160630012452-4_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160630012452-5_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160630012452-6_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160630012452-7_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160630012452-8_.jpg#', '17863963884', 1, '安卓客户端'),
(82, '@陈没有赫 \r\n9图卡顿严重\r\n----------------------------------转发', '2016-06-30 09:47:42', 'http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160630012452-0_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160630012452-1_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160630012452-2_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160630012452-3_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160630012452-4_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160630012452-5_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160630012452-6_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160630012452-7_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160630012452-8_.jpg#', '17863963884', 0, '安卓客户端'),
(83, '@陈没有赫 \r\n@陈没有赫 \r\n9图卡顿严重\r\n----------------------------------转发', '2016-06-30 09:47:54', 'http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160630012452-0_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160630012452-1_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160630012452-2_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160630012452-3_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160630012452-4_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160630012452-5_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160630012452-6_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160630012452-7_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160630012452-8_.jpg#', '17863963884', 0, '安卓客户端'),
(84, '[cp]#快讯#【北京市人民检察院第四分院依法告知和公布雷洋尸检鉴定意见】6月30日，北京市人民检察院第四分院向雷洋死亡案件涉案警务人员及其家属、雷洋家属及双方聘请的律师依法告知了雷洋尸检鉴定意见。检察机关对北京明正司法鉴定中心作出的鉴定意见进行了审查，组织了专家审查论证、文证审查，确定死者雷洋符合胃内容物吸入呼吸道致窒息死亡。检察机关将继续依法侦查，结合侦查工作依法判断事实和证据，准确认定行为性质和责任轻重。\n涉案警务人员在执法中存在不当行为，昌平公安分局东小口派出所副所长邢某某、辅警周某起主要作用，且在案发后有妨碍侦查的行为。根据其行为性质和办案实际需要，北京市人民检察院第四分院已报请北京市人民检察院批准变更强制措施，对邢某某、周某以涉嫌玩忽职守罪依法决定逮捕。', '2016-06-30 16:07:51', 'http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160630160751-0_.jpg#', '17863963884', 0, '安卓客户端'),
(85, '[cp]#尽情自在肯德基#一个第一次进城吃肯德基的人，在你看来他不过跨过了几公里山路，在他看来他跨过的更是因城乡差异而形成的巨大心理落差！物质差距不可怕，可怕的是人心的距离。但我们至少可以少一些冷漠，多一些善意，像这位肯德基员工一样，自在他人，更自在自己！http://t.cn/R5HKkEt[/cp]', '2016-06-30 16:11:26', 'http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160630161126-0_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160630161126-1_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160630161126-2_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160630161126-3_.jpg#', '17863963884', 0, '安卓客户端'),
(86, '机型测试', '2016-06-30 17:25:39', 'http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160630172538-0_.jpg#', '17863963884', 0, 'SM-N9109W'),
(87, 'url测试http://baidu.com', '2016-06-30 17:51:37', 'http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160630175137-0_.jpg#', '17863963884', 0, 'SM-N9109W'),
(88, '越来越乱感觉，http://ecfun.cc     好乱', '2016-06-30 18:13:19', 'http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160630181319-0_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160630181319-1_.jpg#', '17863963884', 0, 'GT-I9508'),
(89, '九图测试，url测试，http://xbwcc.com.cn ', '2016-06-30 18:16:29', 'http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160630181629-0_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160630181629-1_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160630181629-2_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160630181629-3_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160630181629-4_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160630181629-5_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160630181629-6_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160630181629-7_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160630181629-8_.jpg#', '17863963884', 0, 'GT-I9508'),
(90, '@陈没有赫 \r\n九图测试，url测试，http://xbwcc.com.cn \r\n----------------------------------转发', '2016-06-30 18:30:34', 'http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160630181629-0_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160630181629-1_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160630181629-2_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160630181629-3_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160630181629-4_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160630181629-5_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160630181629-6_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160630181629-7_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160630181629-8_.jpg#', '17863963884', 9, 'GT-I9508'),
(91, '即使她脱光了，也不应该成为被强奸的理由\n1、\n\n写这篇文章之前，先说我自己的故事，是真的。\n\n大三的暑假去给学生做家教，走在街上，天热的要死。忽然一辆摩托车停在我的旁边，一个猥琐男问我：“ 把你的丝袜卖给我吧。”\n\n当时的我是迅速跑开了，到我学生家的时候，心还扑通扑通的跳。\n\n后来几天，都是爸爸送我。\n\n我在想，当时那个男的要是强行将我拖走了，是不是会出现这样的舆论：\n\n“ 大热天的不在家里呆着，跑到街上干嘛。”我要去给学生上课行吗?\n\n“ 你穿丝袜不就是勾引别人的吗?”我害怕晒黑了，行吗?\n\n“ 现在的女孩子穿的，不就是等着被拐吗?”我那天穿的是背带裤行吗?\n\n“ 怎么就找你要的，不找别人的?” 这个要问他了，我不知道。\n\n而就在前几天，我下班后拎着电脑去书店看书，写稿，蹭wifi和冷气，等敲完稿子已经晚上九点多了，再拎着电脑回家，觉得头有点痒，就顺便再去洗下头发，回到宿舍只想冲个澡倒头就睡啊。\n\n可是，走在路上的时候，一群染着五颜六色头发的青年迎面走来，对着我吹口哨，还发出恶心死了的声音。我吓得一直默默低着头，拎着电脑赶紧走。到宿舍立马给我妈打电话。\n\n我在想，那晚要是真出点什么事情，是不是事情的舆论会是这样的：\n\n1、那么晚还在外面，肯定不是好女人 2、那么晚穿那么少，就是诱惑别人(夏天不让穿裙子么) 3、怎么不对别人吹口哨的，就对你，苍蝇不叮无缝的蛋4、大晚上洗什么头，不就是为了诱惑别人么(我累死了，回宿舍洗头再吹干很烦，而且我头发真的很长，洗下头不行么) 5、她哪里是去看书的，分明就是想晚上在路上诱惑人的，然而我真是去看书的，再多就是有点私心，是去蹭wifi, 冷气和不需要用钱买的书的。\n\n哪怕我真的不是去看书的，我穿裙子，洗头发，那么晚拎着电脑在街上走只是和心上人约会才回来，也和这群人一点关系都没有。\n\n2、\n\n我自己的故事说完了。这两天有一件事情闹的很火，南方报业某记者强奸实习生。 当中的细节不再赘述，但是微博的有些评论真的让人心凉心寒。就像前一段时间，某顾客在火锅店被服务员泼开水，有人说女顾客态度不好活该被泼，服务员只是个孩子年轻气盛云云。\n\n被病人和病人家属打的医生和护士被指责医德有问题，活该。\n\n被强奸的女子被指责衣着暴露，活该。\n\n被拐骗的人被指责不应轻信他人，活该。\n\n北京男子摔死女童，其母亲被指责不应与人产生争执没有保护好婴儿，活该。\n\n甚至，出去旅游不小心发生车祸，被指责出去旅游个什么劲，活该。\n\n为什么我们总是在指责受害者，还是从道德和科学。同情角度。\n\n从科学角度指责受害者应该如何理性的对待这个事情，应该采取什么样的方式避免伤害，怎么能这么天真，怎么能这么没脑子。\n\n从道德角度指责受害者不该穿着暴露，肯定是平日里存在问题，才会受此攻击。\n\n从同情的角度声称受害者此生完了，这一生带着这个屈辱，算是完了。\n\n那句金科玉律“苍蝇不叮无缝的蛋“ 无数次被搬出来，说的受害者哑口无言，是呀，你要是没缝，苍蝇怎么叮你的?\n\n其实，有缝的蛋，苍蝇也叮的，哪怕就是有缝，苍蝇也不应该叮。\n\n有句话说的太好了，强奸案唯一的原因就是强奸犯，什么穿的暴露，夜晚一个人走在街上等等都是扯淡。\n\n在美国，曾经有一个学生醉酒了，被一个白人留学生强奸了。事后，法官只判了这个留学生几个月监禁。结果超多的美国公民走上街游行，结果这个法官被重判，被终身剥夺判断性案件的权利。\n\n如果在我们国家呢，那女的喝酒还醉酒，活该。\n\n这种从科学角度，道德角度，同情角度的舆论带来的结果无疑是受害者更加受伤，让一些案件屡禁不止。\n\n如果处理医患关系时，大家都去相信“要是这个医生没问题，病人能砍吗”，那么，以后医生必须要穿防弹衣，武装到牙齿上班，而病人则想，反正他们不是说了吗，要是医生没问题，我能砍？好，那我砍吧。\n\n如果处理强奸案时，大家都去相信“是这个女的不自重，不自爱，才会引来强奸“，受害者身体和心灵已经受了一次伤，还要在心灵角度再受一次伤，连最后都觉得被强奸是自己的问题。那么，那些有这种欲望和冲动的人更加肆无忌惮，谁让她那样子的，我强奸，我有理。\n\n如果我们都去同情，断定人家这辈子被毁了，完了，那么受害者这辈子也会觉得自己被毁了，完了。\n\n不不不，我们不应该这样。\n\n我们应该呐喊，指责实施性侵的人，呼吁法律严惩他，让更多的人知道，你这样子做，是要付出惨烈的代价的。\n\n我们应该提倡大家要懂得保护自己，但你要知道，我们保护的再好，都不知道会突然出车祸，突然刮大风，突然起海啸，那个时候，脑子里一片空白。\n\n我们应该同情，但不应该断定人家这辈子完了，我们应该说，会有法律严惩他，你要相信你的未来还很美好，加油。\n\n这样，或许这个世界才会更美一点。\n\n2、\n\n想到了家暴。想起了小时候看过的恐怖电视剧《不要和陌生人说话 》讲的就是家暴的故事，那时候我甚至和我妈妈说：“ 妈妈，我长大了不要结婚。”\n\n前一段时间，看腾讯大家有个人讲到过这个现象，被家暴的妇女求助警察时，警察大多数时候会把这个当做家务事，而不是刑事案件。\n\n大多数办理此案件的都是男性警察。\n\n或许，在他们的思想里，还存在这样子一种思维：男人打老婆，是很正常的事。 老婆，打下也无妨。谁家没个家长里短。\n\n是呀，男人打老婆，不是中国几千年的传统么?打老婆，正常的呀。\n\n有一种爱情，不就是年轻的时候，你爸经常打你妈，后来老了，相依为命，生死相随，可歌可泣么?\n\n可是，也许那是老了打不动了啊。可是，也许你妈很想和你爸恩爱的走一辈子啊，而不是被打一辈子啊。\n\n正因为这种思维，一些女性才会最终走向被丈夫打死的田地。\n\n想到了萧红《呼兰河传》里的小团圆媳妇，也是被婆家活活打死的。\n\n她婆婆说：也就是调教两下，谁家还不打个媳妇啊，也是为了她好啊，打打就乖了啊。\n\n生活里，这样的例子也比比皆是。\n\n“ 你回去调教一下你的老婆。”\n\n“ 让我儿子收拾两下，立马就乖了。”\n\n我教育我的女儿要保护自己，尊重丈夫，孝敬婆婆，那你教育你的儿子要克制自己，尊重妻子了吗 ?\n\n那些被贩卖到山区的女子，先要被关在小黑屋里，打几天，就乖了，接着再强行让人家怀个孩子，“打乖了，再有了娃 ”就跑不了了。\n\n呵呵。所以，才有人呼吁，在处理这类家暴事情的时候，应该让更多的女民警去，作为女人，他们或许更懂身为女人的心。\n\n3、\n\n鲁迅就写过，大意是，现在已经是20世纪了，对男女还是两个标准。一个男人勾引一个女人，女人如果不从，就是贞洁，反抗到死，就是烈女。男人没有任何恶名，社会还是淳朴。如果女人从了，就是失节，男人也没有恶名，可是世风完全被女人败坏了!100年过去了，社会还是这样，动不动就指责女性，哪怕她是受害者。\n然而，我们不要做帮凶，我们应该让这个世界向更好的地方走去。\n\n小太阳祝福大家都幸福。我是一个每天都坚持码字的小乌龟哦。', '2016-06-30 22:39:10', 'http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160630223910-0_.jpg#', '17863963884', 0, 'GT-I9508'),
(92, '我这个人很懒,一个字都不发', '2016-06-30 23:03:08', 'http://139.129.40.202/ecfun/image_bg_upload/upload/_1785347091220160630230308-0_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1785347091220160630230308-1_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1785347091220160630230308-2_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1785347091220160630230308-3_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1785347091220160630230308-4_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1785347091220160630230308-5_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1785347091220160630230308-6_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1785347091220160630230308-7_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1785347091220160630230308-8_.jpg#', '17853470912', 2, 'H60-L01'),
(93, '我这个人很懒,一个字都不发', '2016-07-01 00:35:43', 'http://139.129.40.202/ecfun/image_bg_upload/upload/_1785428830720160701003542-0_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1785428830720160701003543-1_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1785428830720160701003543-2_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1785428830720160701003543-3_.jpg#http://139.129.40.202/ecfun/image_bg_upload/upload/_1785428830720160701003543-4_.jpg#', '17854288307', 0, 'Che2-TL00M'),
(94, '喜欢一个人，始于颜值，陷于才华，忠于人品。', '2016-07-01 00:39:35', 'http://139.129.40.202/ecfun/image_bg_upload/upload/_1785428830720160701003934-0_.jpg#', '17854288307', 5, 'Che2-TL00M'),
(95, '如何解决微博限制推广链接的访问及AppStore的链接跳转？\n\n\n作者：iammutex\n链接：https://www.zhihu.com/question/29270034/answer/46446911\n来源：知乎\n著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。\n\n看了一下 @Tang minyi 的回答，也非常不错，如果面试者这么回答，我也会很高兴的。\n对于我用词比较激烈的问题，我面试时真实想法既是如此，也难得润色了。\n\n--------------------------\n\n这个问题看到就想答。\n个人相关：三年前在公司做过一个短地址服务，目前在线上跑。\n而这个问题，也是我现在招聘面试题里面必考的一道，这一道题里面有很多可考的地方，能够相对综合的考察候选人的功力。\n\n最烂的回答\n实现一个算法，将长地址转成短地址。实现长和短一一对应。然后再实现它的逆运算，将短地址还能换算回长地址。\n这个回答看起来挺完美的，然后候选人也会说现在时间比较短，如果给我时间我去找这个算法就解决问题了。但是稍微有点计算机或者信息论常识的人就能发现，这个算法就跟永动机一样，是永远不可能找到的。即使我们定义短地址是100位。那么它的变化是62的100次方。62=10数字+26大写字母+26小写字母。无论这个数多么大，他也不可能大过世界上可能存在的长地址。所以实现一一对应，本身就是不可能的。\n再换一个说法来反驳，如果真有这么一个算法和逆运算，那么基本上现在的压缩软件都可以歇菜了，而世界上所有的信息，都可以压缩到100个字符。这～可能吗。\n\n另一个很烂的回答\n和上面一样，也找一个算法，把长地址转成短地址，但是不存在逆运算。我们需要把短对长的关系存到DB中，在通过短查长时，需要查DB。\n怎么说呢，没有改变本质，如果真有这么一个算法，那必然是会出现碰撞的，也就是多个长地址转成了同一个短地址。因为我们无法预知会输入什么样的长地址到这个系统中，所以不可能实现这样一个绝对不碰撞的hash函数。\n\n比较烂的回答\n那我们用一个hash算法，我承认它会碰撞，碰撞后我再在后面加1，2，3不就行了。\nok，这样的话，当通过这个hash算法算出来之后，可能我们会需要做btree式的大于小于或者like查找到能知道现在应该在后面加1，2，或3，这个也可能由于输入的长地址集的不确定性。导致生成短地址时间的不确定性。同样烂的回答还有随机生成一个短地址，去查找是否用过，用过就再随机，如此往复，直到随机到一个没用过的短地址。\n\n正确的原理\n上面是几种典型的错误回答，下面咱们直接说正确的原理。\n正确的原理就是通过发号策略，给每一个过来的长地址，发一个号即可，小型系统直接用mysql的自增索引就搞定了。如果是大型应用，可以考虑各种分布式key-value系统做发号器。不停的自增就行了。第一个使用这个服务的人得到的短地址是http://xx.xx/0 第二个是 http://xx.xx/1 第11个是 http://xx.xx/a 第依次往后，相当于实现了一个62进制的自增字段即可。\n\n几个子问题\n\n1. 62进制如何用数据库或者KV存储来做？\n其实我们并不需要在存储中用62进制，用10进制就好了。比如第10000个长地址，我们给它的短地址对应的编号是9999，我们通过存储自增拿到9999后，再做一个10进制到62进制的转换，转成62进制数即可。这个10～62进制转换，你完全都可以自己实现。\n\n2. 如何保证同一个长地址，每次转出来都是一样的短地址\n上面的发号原理中，是不判断长地址是否已经转过的。也就是说用拿着百度首页地址来转，我给一个http://xx.xx/abc 过一段时间你再来转，我还会给你一个 http://xx.xx/xyz。这看起来挺不好的，但是不好在哪里呢？不好在不是一一对应，而一长对多短。这与我们完美主义的基因不符合，那么除此以外还有什么不对的地方？\n有人说它浪费空间，这是对的。同一个长地址，产生多条短地址记录，这明显是浪费空间的。那么我们如何避免空间浪费，有人非常迅速的回答我，建立一个长对短的KV存储即可。嗯，听起来有理，但是。。。这个KV存储本身就是浪费大量空间。所以我们是在用空间换空间，而且貌似是在用大空间换小空间。真的划算吗？这个问题要考虑一下。当然，也不是没有办法解决，我们做不到真正的一一对应，那么打个折扣是不是可以搞定？这个问题的答案太多种，各有各招，我这就不说了。（由于实在太多人纠结这个问题，请见我最下方的更新）\n\n3. 如何保证发号器的大并发高可用\n上面设计看起来有一个单点，那就是发号器。如果做成分布式的，那么多节点要保持同步加1，多点同时写入，这个嘛，以CAP理论看，是不可能真正做到的。其实这个问题的解决非常简单，我们可以退一步考虑，我们是否可以实现两个发号器，一个发单号，一个发双号，这样就变单点为多点了？依次类推，我们可以实现1000个逻辑发号器，分别发尾号为0到999的号。每发一个号，每个发号器加1000，而不是加1。这些发号器独立工作，互不干扰即可。而且在实现上，也可以先是逻辑的，真的压力变大了，再拆分成独立的物理机器单元。1000个节点，估计对人类来说应该够用了。如果你真的还想更多，理论上也是可以的。\n\n4. 具体存储如何选择\n这个问题就不展开说了，各有各道，主要考察一下对存储的理解。对缓存原理的理解，和对市面上DB、Cache系统可用性，并发能力，一致性等方面的理解。\n\n5. 跳转用301还是302\n这也是一个有意思的话题。首先当然考察一个候选人对301和302的理解。浏览器缓存机制的理解。然后是考察他的业务经验。301是永久重定向，302是临时重定向。短地址一经生成就不会变化，所以用301是符合http语义的。同时对服务器压力也会有一定减少。\n但是如果使用了301，我们就无法统计到短地址被点击的次数了。而这个点击次数是一个非常有意思的大数据分析数据源。能够分析出的东西非常非常多。所以选择302虽然会增加服务器压力，但是我想是一个更好的选择。\n\n大概就是这样。\n\n------五一假期后更新-------\n就回答一点大家最纠结的问题吧，就是如何实现同一个长地址多次转换，出来还是同一个短地址。\n\n我上面其实讲到了，这个方案最简单的是建立一个长对短的hashtable，这样相当于用空间来换空间，同时换取一个设计上的优雅（真正的一对一）。\n\n实际情况是有很多性价比高的打折方案可以用，这个方案设计因人而异了。那我就说一下我的方案吧。\n\n我的方案是：用key-value存储，保存“最近”生成的长对短的一个对应关系。注意是“最近”，也就是说，我并不保存全量的长对短的关系，而只保存最近的。比如采用一小时过期的机制来实现LRU淘汰。\n\n这样的话，长转短的流程变成这样：\n1 在这个“最近”表中查看一下，看长地址有没有对应的短地址\n1.1 有就直接返回，并且将这个key-value对的过期时间再延长成一小时\n1.2 如果没有，就通过发号器生成一个短地址，并且将这个“最近”表中，过期时间为1小时\n\n所以当一个地址被频繁使用，那么它会一直在这个key-value表中，总能返回当初生成那个短地址，不会出现重复的问题。如果它使用并不频繁，那么长对短的key会过期，LRU机制自动就会淘汰掉它。\n\n当然，这不能保证100%的同一个长地址一定能转出同一个短地址，比如你拿一个生僻的url，每间隔1小时来转一次，你会得到不同的短地址。但是这真的有关系吗？\n\n-------------------------来自知乎', '2016-07-02 17:25:25', 'http://139.129.40.202/ecfun/image_bg_upload/upload/_1786396388420160702172525-0_.jpg#', '17863963884', 0, 'GT-I9508'),
(96, '服务器更换测试', '2016-07-04 01:22:21', 'http://115.159.26.120/ecfun/image_bg_upload/upload/_1786396388420160704012221-0_.jpg#', '17863963884', 5, 'GT-I9508'),
(97, '@图像处理过 \r\n服务器更换测试\r\n----------------------------------转发', '2016-09-16 14:23:30', 'http://115.159.26.120/ecfun/image_bg_upload/upload/_1786396388420160704012221-0_.jpg#', '17854259542', 0, 'GT-I9508');

-- --------------------------------------------------------

--
-- Table structure for table `user_information`
--

CREATE TABLE IF NOT EXISTS `user_information` (
  `user_name` varchar(256) CHARACTER SET gbk NOT NULL DEFAULT '蜡笔小新没有心',
  `user_id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `user_phone` varchar(20) CHARACTER SET gbk NOT NULL,
  `user_signtime` varchar(256) CHARACTER SET gbk NOT NULL,
  `user_head` varchar(512) CHARACTER SET gbk NOT NULL,
  `user_pwd` varchar(256) CHARACTER SET gbk NOT NULL,
  `user_token` varchar(256) CHARACTER SET gbk NOT NULL,
  PRIMARY KEY (`user_id`)
) ENGINE=InnoDB  DEFAULT CHARSET=latin1 AUTO_INCREMENT=13 ;

--
-- Dumping data for table `user_information`
--

INSERT INTO `user_information` (`user_name`, `user_id`, `user_phone`, `user_signtime`, `user_head`, `user_pwd`, `user_token`) VALUES
('图像处理过', 2, '17863963884', '2016-05-08 00:07:02', 'http://115.159.26.120/ecfun/image_head/upload/_17863963884_.jpg', 'xbw12138', 'e1f80ebc9c6128314254afbac9299015e712cf4e'),
('小慧慧', 3, '17805428721', '2016-05-10 13:35:44', 'http://115.159.26.120/ecfun/image_head/upload/_17805428721_.jpg', '1234567', ''),
('弯眉间i', 4, '17854253157', '2016-05-10 22:36:05', 'http://115.159.26.120/ecfun/image_head/upload/_17854253157_.jpg', 'liuyueliuyue', ''),
('苏格拉没有底', 5, '17854259542', '2016-05-10 23:21:28', '', 'xbw12138', 'e1f80ebc9c6128314254afbac9299015e712cf4e'),
('蜡笔小新没有心', 6, '17854251361', '2016-05-11 06:59:30', '', '950517', ''),
('蜡笔小新没有心', 7, '17854259555', '2016-05-16 00:07:02', '', '123', ''),
('蜡笔小新没有心', 8, '17854258669', '2016-06-23 23:58:25', '', '12345678', ''),
('coconut', 9, '17854288307', '2016-06-30 18:53:56', 'http://115.159.26.120/ecfun/image_head/upload/_17854288307_.jpg', 'xiaohua5294325', ''),
('蜡笔小新没有心', 10, '17853470912', '2016-06-30 23:00:47', '', 'LXH0609', ''),
('蜡笔小新没有心', 11, '13658667478', '2016-07-12 22:12:25', '', 'xiaobao', '63aa3ed9859eb9ba4a7f885dee9461cea04394c7'),
('蜡笔小新没有心', 12, '18766260763', '2016-07-26 12:53:43', '', 'lishuang', 'a17f7a51770fe03242aa830dca111923e3745061');

-- --------------------------------------------------------

--
-- Table structure for table `zan_information`
--

CREATE TABLE IF NOT EXISTS `zan_information` (
  `zan_id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `pl_num` int(10) NOT NULL,
  `user_phone` varchar(20) CHARACTER SET gbk NOT NULL,
  `num` int(10) NOT NULL,
  PRIMARY KEY (`zan_id`)
) ENGINE=InnoDB DEFAULT CHARSET=latin1 AUTO_INCREMENT=1 ;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
